Домашнее задание 2

Задача 1: 
Задайте одномерный массив из 10 целых чисел от 1 до 100. 
Найдите количество элементов массива, значения которых лежат в отрезке [20,90].
Программа.
int[] numbers = new int[] { 10, 20, 30, 40, 50, 60, 70, 80, 90, 100 };
int count = 0;
foreach (int number in numbers)
    if (number >= 20 && number <= 90)
        count++;
Console.WriteLine("Количество элементов массива, значения которых лежат в отрезке от 20 до 90: " + count);
 
Задача 2: 
Задайте массив на 10 целых чисел. 
Напишите программу, которая определяет количество чётных чисел в массиве.
int[] array = new int[] { 10, 20, 30, 40, 50, 60, 70, 80, 90, 100 };
int evenCount = 0;
for (int i = 0; i < array.Length; i++)
{
    if (array[i] % 2 == 0) // Проверка на четность
    {
        evenCount++;
    }
}

// Вывод результата
Console.WriteLine("Сгенерированный массив: " + string.Join(", ", array));
Console.WriteLine("Количество четных чисел в массиве: " + evenCount);
 
Задача3: 
Задайте массив из вещественных чисел с ненулевой дробной частью. 
Найдите разницу между максимальным и минимальным элементов массива.
Программа.
int[] array = new int[] { 10, 20, 30, 40, 50, 60, 70, 80, 90, 100 };

double max = array[0];
double min = array[0];

for (int i = 1; i < array.Length; i++)
{
    if (array[i] > max)
    {
        max = array[i];
    }
    if (array[i] < min)
    {
        min = array[i];
    }
}
double difference = max - min;

Console.WriteLine("Сгенерированный массив: " + string.Join(", ", array));
Console.WriteLine("Разница между максимальным и минимальным элементами: " + difference);
 
Задача 4*: 
Дано натуральное число в диапазоне от 1 до 100 000. 
Создайте массив, состоящий из цифр этого числа. 
Старший разряд числа должен располагаться на 0-м индексе массива, младший – на последнем. 
Размер массива должен быть равен количеству цифр.
Программа.
Console.Write("Введите натуральное число от 1 до 100000: ");
int number;
while (!int.TryParse(Console.ReadLine(), out number) || number < 1 || number > 100000)
{
    Console.WriteLine("Некорректный ввод. Пожалуйста, введите число от 1 до 100000.");
}

string numberString = number.ToString();
int length = numberString.Length;

int[] digits = new int[length];

for (int i = 0; i < length; i++)
{
    digits[i] = (int)char.GetNumericValue(numberString[length - 1 - i]);
}

Console.WriteLine("Массив цифр числа: " + string.Join(", ", digits));
