Задача 1: Напишите программу, которая на вход принимает 
два числа и выдает, какое число большее, а какое меньшее.
a = 5; b = 7 ->  max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3
Программа.
Console.Write("Введите первое число (a): ");
int a = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите второе число (b): ");
int b = Convert.ToInt32(Console.ReadLine());

int max = Math.Max(a, b);
int min = Math.Min(a, b);

Console.WriteLine($"max = {max}");
Console.WriteLine($"min = {min}");

 
Задача 2: Напишите программу, которая принимает на вход 
три числа и выдает максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
Программа.
Console.WriteLine("Введите три числа, разделенные пробелами:");
string input = Console.ReadLine();

string[] numbers = input.Split(' ');

int num1 = int.Parse(numbers[0]);
int num2 = int.Parse(numbers[1]);
int num3 = int.Parse(numbers[2]);

int max = Math.Max(num1, Math.Max(num2, num3));

Console.WriteLine($"Максимальное число: {max}");
 
Задача 3: Напишите программу, которая на вход принимает 
число и выдает, является ли число четным (делится ли оно на два без остатка).
4 -> да
-3 -> нет
7 -> нет
Программа.
Console.WriteLine("Введите число:");
string input = Console.ReadLine();

int number;
if (int.TryParse(input, out number))
{
    if (number % 2 == 0)
    {
        Console.WriteLine($"{number} -> Чётное");
    }
    else
    {
        Console.WriteLine($"{number} -> Не чётное");
    }
}
else
{
    Console.WriteLine("Ошибка: введите корректное целое число.");
}
 
Задача 4: Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8
Программа.
Console.WriteLine("Введите число N:");
string input = Console.ReadLine();

int N;
if (int.TryParse(input, out N) && N > 0)
{
    Console.WriteLine($"Четные числа от 1 до {N}:");

    for (int i = 2; i <= N; i += 2)
    {
        Console.Write(i);

        if (i + 2 <= N)
        {
            Console.Write(", ");
        }
    }
    Console.WriteLine();
}
else
{
    Console.WriteLine("Ошибка: введите корректное положительное целое число.");
}
 
Задача 5: 
Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
Программа.
            Console.WriteLine("Введите число:");
            string input = Console.ReadLine();
            int number;
            if (int.TryParse(input, out number))
            {
                if (number % 7 == 0 && number % 23 == 0)
                {
                    Console.WriteLine($"{number} -> Число кратно 7 и 23");
                }
                else
                {
                    Console.WriteLine($"{number} -> Число не кратно 7 и 23");
                }
            }
            else
            {
                Console.WriteLine("Ошибка: введите корректное целое число.");
            }
 
Задача 6: 
Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер координатной четверти плоскости, в которой находится эта точка.
Программа.
Console.WriteLine("Введите координаты точки (X и Y), где X не равен 0 и Y не равен 0:");

Console.Write("Введите X: ");
string inputX = Console.ReadLine();
double x;


Console.Write("Введите Y: ");
string inputY = Console.ReadLine();
double y;

if (double.TryParse(inputX, out x) && double.TryParse(inputY, out y) && x != 0 && y != 0)
{
    if (x > 0 && y > 0)
    {
        Console.WriteLine("Точка находится в 1-й четверти.");
    }
    else if (x < 0 && y > 0)
    {
        Console.WriteLine("Точка находится во 2-й четверти.");
    }
    else if (x < 0 && y < 0)
    {
        Console.WriteLine("Точка находится в 3-й четверти.");
    }
    else
    {
        Console.WriteLine("Точка находится в 4-й четверти.");
    }
}
else
{
    Console.WriteLine("Ошибка: введите корректные координаты, где X ≠ 0 и Y ≠ 0.");
}
 
Задача 7: 
Напишите программу, которая принимает на вход целое число из отрезка [10, 99] и показывает наибольшую цифру числа.
Программа.
            Console.WriteLine("Введите целое число из отрезка [10, 99]:");
            string input = Console.ReadLine();

            if (int.TryParse(input, out int number) && number >= 10 && number <= 99)
            {
                int tens = number / 10; 
                int units = number % 10; 

                int maxDigit = Math.Max(tens, units);

                Console.WriteLine($"Наибольшая цифра числа {number} -> {maxDigit}");
            }
            else
            {
                Console.WriteLine("Ошибка: введите корректное целое число из отрезка [10, 99].");
            }
 
Задача 8: 
Напишите программу, которая на вход принимает натуральное число N, а на выходе показывает его цифры через запятую.
Программа.
Console.WriteLine("Введите натуральное число:");
 string input = Console.ReadLine();

 if (ulong.TryParse(input, out ulong number) && number > 0)
 {
     string numberString = number.ToString();
     string result = string.Join(", ", numberString.ToCharArray());

     Console.WriteLine($"Цифры числа {number} через запятую: {result}");
 }
 else
 {
     Console.WriteLine("Ошибка: введите корректное натуральное число.");
 }
